package org.krylov;

// Визначте номер дня в році по заданому номеру дня в місяці та номеру місяця
// Вводяться як аргументи при виклику програми. Ознака, чи є рік високосним, задається як булевська змінна.
//
// Вказівка: кількість днів до початку цього місяця (НЕ високосний рік):
// січень 0, лютий - 31, березень - 59, квітень - 90, травень - 120, червень - 151 , липень - 181, серпень - 212, вересень - 243, жовтень - 273, листопад - 314, грудень - 334 задати у вигляді масиву.
// У високосному році, починаючи з березня, до кількості днів додається 1.

public class Task4 {

	private static final int[] monthToDays = {0, 31, 59, 90, 120, 151, 181, 212, 243, 273, 314, 334};

	public int getDayOfYear(int day, int month, boolean isLeap) {
		int additionalDay = isLeap && month > 2 ? 1 : 0;

		return monthToDays[month - 1] + day + additionalDay;
	}
}
